УчетВУправляющихДляГит1/src/Enums/ВидыУведомленийОСпецрежимахНалогообложения/ВидыУведомленийОСпецрежимахНалогообложения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыУведомленийОСпецрежимахНалогообложения</name>
  <enumValues>
    <name>УведомлениеОПереходеНаУСН</name>
  </enumValues>
  <enumValues>
    <name>УведомлениеОбУтратеПраваНаУСН</name>
  </enumValues>
  <enumValues>
    <name>УведомлениеОбОтказеОтУСН</name>
  </enumValues>
  <enumValues>
    <name>УведомлениеОбИзмененииОбъектаНалогообложенияПоУСН</name>
  </enumValues>
  <enumValues>
    <name>УведомлениеОПрекращенииДеятельностиПоУСН</name>
  </enumValues>
  <enumValues>
    <name>ЗаявлениеНаПолучениеПатента</name>
  </enumValues>
  <enumValues>
    <name>ЗаявлениеНаПолучениеПатентаРекомендованнаяФорма</name>
  </enumValues>
  <enumValues>
    <name>ЗаявлениеОбУтратеПраваНаПатент</name>
  </enumValues>
  <enumValues>
    <name>ЗаявлениеОПрекращенииДеятельностиПоПатентнойСистеме</name>
  </enumValues>
  <enumValues>
    <name>ФормаЕНВД1</name>
  </enumValues>
  <enumValues>
    <name>ФормаЕНВД2</name>
  </enumValues>
  <enumValues>
    <name>ФормаЕНВД3</name>
  </enumValues>
  <enumValues>
    <name>ФормаЕНВД4</name>
  </enumValues>
  <enumValues>
    <name>ФормаС09_1</name>
  </enumValues>
  <enumValues>
    <name>ФормаС09_2</name>
  </enumValues>
  <enumValues>
    <name>ФормаС09_3_1</name>
  </enumValues>
  <enumValues>
    <name>ФормаС09_3_2</name>
  </enumValues>
  <enumValues>
    <name>ФормаС09_4</name>
  </enumValues>
  <enumValues>
    <name>Форма_1_6_Учет</name>
  </enumValues>
  <enumValues>
    <name>ФормаУ_ИО</name>
  </enumValues>
  <enumValues>
    <name>ФормаТС1</name>
  </enumValues>
  <enumValues>
    <name>ФормаТС2</name>
  </enumValues>
  <enumValues>
    <name>ФормаС09_6</name>
  </enumValues>
  <enumValues>
    <name>ЗаявлениеИсключенииПроверки</name>
  </enumValues>
  <enumValues>
    <name>ЗаявлениеПостановкаОбъектаНВОС</name>
  </enumValues>
  <enumValues>
    <name>ФормаР21001</name>
  </enumValues>
  <enumValues>
    <name>ФормаР24001</name>
  </enumValues>
  <enumValues>
    <name>ФормаР11001</name>
  </enumValues>
  <enumValues>
    <name>ФормаР13001</name>
  </enumValues>
  <enumValues>
    <name>ФормаР14001</name>
  </enumValues>
  <enumValues>
    <name>ФормаКИК</name>
  </enumValues>
  <enumValues>
    <name>СообщениеОНаделенииОППолномочиямиПоВыплатам</name>
  </enumValues>
  <enumValues>
    <name>ФормаСИО</name>
  </enumValues>
  <enumValues>
    <name>НевозможностьПредоставленияДокументов</name>
  </enumValues>
  <enumValues>
    <name>ЗаявлениеОВозвратеНалога</name>
  </enumValues>
  <enumValues>
    <name>ЗаявлениеОЗачетеНалога</name>
  </enumValues>
  <enumValues>
    <name>ДекларацияОХарактеристикахОбъектаНедвижимости</name>
  </enumValues>
  <enumValues>
    <name>ЗаявлениеОПредоставленииРассрочкиФСС</name>
  </enumValues>
  <enumValues>
    <name>ЗаявлениеОПримененииНалоговойЛьготыУчастникамиРегиональныхИнвестиционныхПроектов</name>
  </enumValues>
  <enumValues>
    <name>ПостановкаСнятиеВКачествеНалоговогоАгента</name>
  </enumValues>
  <enumValues>
    <name>СогласиеНаРаскрытиеНалоговойТайны</name>
  </enumValues>
  <enumValues>
    <name>УведомлениеУчастникаСколково</name>
  </enumValues>
  <enumValues>
    <name>ЗаявлениеНаПолучениеДокументаНалоговогоРезидента</name>
  </enumValues>
  <enumValues>
    <name>УведомлениеУменьшениеНалогаККТ</name>
  </enumValues>
  <enumValues>
    <name>ЗаявлениеОсвобождениеОтСтраховыхВзносов</name>
  </enumValues>
  <enumValues>
    <name>УведомлениеОбОткрытииЗакрытииСчета</name>
  </enumValues>
  <enumValues>
    <name>УведомлениеОбИзмененииРеквизитовСчета</name>
  </enumValues>
  <enumValues>
    <name>УведомлениеОНаличииСчета</name>
  </enumValues>
  <enumValues>
    <name>УведомлениеПорядокПредставленияНалоговыхДеклараций</name>
  </enumValues>
  <enumValues>
    <name>УведомлениеРанееПредставленныеДокументы</name>
  </enumValues>
  <enumValues>
    <name>УведомлениеНДДДУС</name>
  </enumValues>
  <enumValues>
    <name>ЗаявлениеНДДДУС</name>
  </enumValues>
  <enumValues>
    <name>УведомлениеКЛМК</name>
  </enumValues>
  <enumValues>
    <name>УведомлениеПрекращениеЕСХН</name>
  </enumValues>
  <enumValues>
    <name>ОсвобождениеОтНДСПриЕСХН</name>
  </enumValues>
  <enumValues>
    <name>ИзменениеРегиональныхНалогов</name>
  </enumValues>
  <enumValues>
    <name>ОсвобождениеОтУплатыНДС</name>
  </enumValues>
</mdclass:Enum>

УчетВУправляющихДляГит1/src/Documents/УведомлениеОСпецрежимахНалогообложения/УведомлениеОСпецрежимахНалогообложения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УведомлениеОСпецрежимахНалогообложения</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидУведомления</name>
    <type>
      <types>EnumRef.ВидыУведомленийОСпецрежимахНалогообложения</types>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеУведомления</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>РегистрацияВИФНС</name>
    <type>
      <types>CatalogRef.РегистрацииВНалоговомОргане</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодписантПризнак</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПодписантФамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПодписантИмя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПодписантОтчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПодписантДокумент</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>120</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПодписи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПодписантТелефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяОтчета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФормы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Document>

УчетВУправляющихДляГит1/src/CommonModules/УведомлениеОСпецрежимахНалогообложения/Module.bsl
#Область ПрограммныйИнтерфейс

// Функция возвращает таблицу уведомлений в соответствии с установленным отбором
// в хронологическом порядке по убыванию
//
// Параметры:
//  Отбор - Структура - задает условия поиска:
//    * Организация    - СправочникСсылка.Организации
//    * ВидУведомления  - ПеречислениеСсылка.ВидыУведомленийОСпецрежимахНалогообложения
//
// Возвращаемое значение:
//  ТаблицаЗначений
//    * Ссылка - ДокументСсылка.УведомлениеОСпецрежимахНалогообложения
//    * Дата - Дата
//    * ИмяФормы - Строка - имя формы
//
Функция НайтиУведомления(Отбор) Экспорт
	
	Запрос = Новый Запрос;
	
	ТекстЗапроса =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	УведомлениеОСпецрежимахНалогообложения.Ссылка КАК Ссылка,
		|	УведомлениеОСпецрежимахНалогообложения.Дата КАК Дата,
		|	УведомлениеОСпецрежимахНалогообложения.ИмяФормы КАК ИмяФормы
		|ИЗ
		|	Документ.УведомлениеОСпецрежимахНалогообложения КАК УведомлениеОСпецрежимахНалогообложения
		|ГДЕ
		|	НЕ УведомлениеОСпецрежимахНалогообложения.ПометкаУдаления";
	
	Организация = Неопределено;
	Если Отбор.Свойство("Организация", Организация) Тогда
		Запрос.УстановитьПараметр("Организация", Организация);
		ТекстЗапроса = ТекстЗапроса + "
		|	И УведомлениеОСпецрежимахНалогообложения.Организация = &Организация";
	КонецЕсли;
	
	ВидУведомления = Неопределено;
	Если Отбор.Свойство("ВидУведомления", ВидУведомления) Тогда
		Запрос.УстановитьПараметр("ВидУведомления", ВидУведомления);
		ТекстЗапроса = ТекстЗапроса + "
		|	И УведомлениеОСпецрежимахНалогообложения.ВидУведомления = &ВидУведомления";
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса + "
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата УБЫВ";
	
	Запрос.Текст = ТекстЗапроса;
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Функция возвращает таблицу уведомлений в соответствии с установленным отбором
// в хронологическом порядке по убыванию
//
// Параметры:
//  Организация - СправочникСсылка.Организации
//
// Возвращаемое значение:
//  Неопределено, если данных нет (нет формы Р11001)
//  Структура с ключами
//      - УставныйКапитал - Число, размер уставного капитала в рублях (1)
//      - Учредители - Таблица значений с колонками
//          - ИНН - Строка, ИНН учредителя (2.1)
//          - Учредитель - Строка, наименование учредителя (2.2)
//          - СуммаКапитала - Число - стоимость доли в уставном капитале (2.3)
//
Функция ПолучитьСведенияОбУставномКапиталеФормыР11001(Организация) Экспорт 
	Если Метаданные.Отчеты.Найти("РегламентированноеУведомлениеФормаР11001") = Неопределено Тогда 
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	УведомлениеОСпецрежимахНалогообложения.Ссылка
		|ИЗ
		|	Документ.УведомлениеОСпецрежимахНалогообложения КАК УведомлениеОСпецрежимахНалогообложения
		|ГДЕ
		|	УведомлениеОСпецрежимахНалогообложения.ВидУведомления = ЗНАЧЕНИЕ(Перечисление.ВидыУведомленийОСпецрежимахНалогообложения.ФормаР11001)
		|	И УведомлениеОСпецрежимахНалогообложения.Организация = &Организация
		|	И НЕ УведомлениеОСпецрежимахНалогообложения.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	УведомлениеОСпецрежимахНалогообложения.Дата УБЫВ";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат Отчеты["РегламентированноеУведомлениеФормаР11001"].ПолучитьДанныеОтчета(ВыборкаДетальныеЗаписи.Ссылка);
	КонецЦикла;
	
	Возврат Неопределено;
КонецФункции
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СформироватьСтруктуруДанныхУведомленияРек(Форма, ИмяОтчета, Строка)
	Для Каждого ПодчМнг Из Строка.ПолучитьЭлементы() Цикл
		Если ПодчМнг.ПолучитьЭлементы().Количество() > 0 Тогда
			СформироватьСтруктуруДанныхУведомленияРек(Форма, ИмяОтчета, ПодчМнг);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ПодчМнг.ИДНаименования) Тогда 
			СтруктураМногостраничнойСтраницыПодч = Новый Структура("УИД, УИДРодителя", ПодчМнг.УИД, ПолучитьУИДРодителя(ПодчМнг));
			МакетДокумента = Отчеты[ИмяОтчета].ПолучитьМакет(ПодчМнг.ИмяМакета);
			Для Каждого Обл Из МакетДокумента.Области Цикл 
				Если Обл.ТипОбласти = ТипОбластиЯчеекТабличногоДокумента.Прямоугольник 
					И Обл.СодержитЗначение Тогда 
					
					СтруктураМногостраничнойСтраницыПодч.Вставить(Обл.Имя);
				КонецЕсли;
			КонецЦикла;
			
			СЗ = Новый СписокЗначений;
			СЗ.Добавить(СтруктураМногостраничнойСтраницыПодч);
			Форма.ДанныеМногостраничныхРазделов.Вставить(ПодчМнг.ИДНаименования, СЗ);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура СформироватьСтруктуруДанныхУведомления(Форма, ЕстьМногостраничность = Ложь) Экспорт 
	Форма.ДанныеУведомления = Новый Структура;
	Если ЕстьМногостраничность Тогда 
		Форма.ДанныеМногостраничныхРазделов = Новый Структура;
	КонецЕсли;
	Разложение = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Форма.ИмяФормы, ".");
	
	Для Каждого Стр Из Форма.ДеревоСтраниц.ПолучитьЭлементы() Цикл
		Если Стр.Многостраничность Тогда 
			Если Стр.Многострочность Тогда
				// пока пусто
			Иначе
				МнгСтр = Стр.ПолучитьЭлементы()[0];
				
				СтруктураМногостраничнойСтраницы = Новый Структура("УИД", МнгСтр.УИД);
				МакетДокумента = Отчеты[Разложение[1]].ПолучитьМакет(МнгСтр.ИмяМакета);
				Для Каждого Обл Из МакетДокумента.Области Цикл 
					Если Обл.ТипОбласти = ТипОбластиЯчеекТабличногоДокумента.Прямоугольник 
						И Обл.СодержитЗначение Тогда 
						
						СтруктураМногостраничнойСтраницы.Вставить(Обл.Имя);
					КонецЕсли;
				КонецЦикла;
				
				Если МнгСтр.ПолучитьЭлементы().Количество() > 0 Тогда
					СформироватьСтруктуруДанныхУведомленияРек(Форма, Разложение[1], МнгСтр);
				КонецЕсли;
				
				СЗ = Новый СписокЗначений;
				СЗ.Добавить(СтруктураМногостраничнойСтраницы);
				Форма.ДанныеМногостраничныхРазделов.Вставить(МнгСтр.ИДНаименования, СЗ);
			КонецЕсли;
		Иначе
			Если Стр.Многострочность Тогда
				ОбластиВМногостраничнойЧасти = Новый Соответствие;
				МакетДокумента = Отчеты[Разложение[1]].ПолучитьМакет(Стр.ИмяМакета);
				Для Каждого Мнг Из Стр.МногострочныеЧасти Цикл
					Для Каждого Обл Из МакетДокумента.ПолучитьОбласть(Мнг.Значение).Области Цикл 
						Если Обл.ТипОбласти = ТипОбластиЯчеекТабличногоДокумента.Прямоугольник 
							И Обл.СодержитЗначение Тогда 
							
							ОбластиВМногостраничнойЧасти.Вставить(Обл.Имя, Истина);
						КонецЕсли;
					КонецЦикла;
				КонецЦикла;
				
				СтруктураСтраницы = Новый Структура;
				МакетДокумента = Отчеты[Разложение[1]].ПолучитьМакет(Стр.ИмяМакета);
				Для Каждого Обл Из МакетДокумента.Области Цикл 
					Если Обл.ТипОбласти = ТипОбластиЯчеекТабличногоДокумента.Прямоугольник 
						И Обл.СодержитЗначение
						И ОбластиВМногостраничнойЧасти[Обл.Имя] = Неопределено Тогда 
						
						СтруктураСтраницы.Вставить(Обл.Имя);
					КонецЕсли;
				КонецЦикла;
				Форма.ДанныеУведомления.Вставить(Стр.ИДНаименования, СтруктураСтраницы);
			Иначе
				СтруктураСтраницы = Новый Структура;
				МакетДокумента = Отчеты[Разложение[1]].ПолучитьМакет(Стр.ИмяМакета);
				Для Каждого Обл Из МакетДокумента.Области Цикл 
					Если Обл.ТипОбласти = ТипОбластиЯчеекТабличногоДокумента.Прямоугольник 
						И Обл.СодержитЗначение Тогда 
						
						СтруктураСтраницы.Вставить(Обл.Имя);
					КонецЕсли;
				КонецЦикла;
				Форма.ДанныеУведомления.Вставить(Стр.ИДНаименования, СтруктураСтраницы);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура СформироватьСпискиВыбора(Форма, ИмяМакета) Экспорт
	Форма.СпискиВыбора.Очистить();
	Разложение = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Форма.ИмяФормы, ".");
	МакетСписковВыбора = Отчеты[Разложение[1]].ПолучитьМакет(ИмяМакета);
	
	ОблВсеСписки = МакетСписковВыбора.Области.Найти("КоллекцияСписков");
	Если ОблВсеСписки = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	ТекущаяСтрока = ОблВсеСписки.Верх;
	Пока ТекущаяСтрока <= ОблВсеСписки.Низ Цикл
		ИДНаименования = МакетСписковВыбора.Область(ТекущаяСтрока, 1, ТекущаяСтрока, 1).Текст;
		Если Не ЗначениеЗаполнено(ИДНаименования) Тогда 
			Прервать;
		КонецЕсли;
		
		ИмяПоля = МакетСписковВыбора.Область(ТекущаяСтрока, 2, ТекущаяСтрока, 2).Текст;
		ИмяСписка = МакетСписковВыбора.Область(ТекущаяСтрока, 3, ТекущаяСтрока, 3).Текст;
		
		Список = МакетСписковВыбора.Область(ИмяСписка);
		ТС = Список.Верх;
		Пока ТС <= Список.Низ Цикл
			Код = МакетСписковВыбора.Область(ТС, 1, ТС, 1).Текст;
			Наименование = МакетСписковВыбора.Область(ТС, 2, ТС, 2).Текст;
			Если Не ЗначениеЗаполнено(Код) И Не ЗначениеЗаполнено(Наименование) Тогда 
				Прервать;
			КонецЕсли;
			
			НовСтр = Форма.СпискиВыбора.Добавить();
			НовСтр.ИДНаименования = ИДНаименования;
			НовСтр.ИмяПоля = ИмяПоля;
			НовСтр.Код = Код;
			НовСтр.Наименование = Наименование;
			
			ТС = ТС + 1;
		КонецЦикла;
		ТекущаяСтрока = ТекущаяСтрока + 1;
	КонецЦикла;
КонецПроцедуры

Функция ЭтоПолеАдресаРегистрационныхЗаявлений(Поле) Экспорт 
	НрегПоле = НРег(Поле);
	Если СтрЗаканчиваетсяНа(НрегПоле, "типдома")
		Или СтрЗаканчиваетсяНа(НрегПоле, "дом")
		Или СтрЗаканчиваетсяНа(НрегПоле, "типкорпуса")
		Или СтрЗаканчиваетсяНа(НрегПоле, "корпус")
		Или СтрЗаканчиваетсяНа(НрегПоле, "типквартиры")
		Или СтрЗаканчиваетсяНа(НрегПоле, "квартира") Тогда 
		
		Возврат Истина;
	Иначе 
		Возврат Ложь;
	КонецЕсли;
КонецФункции

Процедура ВывестиСтрокуНаПечатьСКонтролемДляРегистрационныхЗаявлений(Строка, ПрефиксПараметра, ОбластиМакета, СимволПоУмолчанию = "", ВыходЗаПределы = Ложь) Экспорт 
	ДлинаСтроки = СтрДлина(Строка);
	
	ИмяПараметра = ПрефиксПараметра + "_" + Формат(ДлинаСтроки, "ЧГ=");
	Если ДлинаСтроки > 1 И ОбластиМакета.Найти(ИмяПараметра) = Неопределено И ОбластиМакета.Найти(ПрефиксПараметра + "_1") <> Неопределено Тогда 
		ВыходЗаПределы = Истина;
	КонецЕсли;
	
	ВывестиСтрокуНаПечать(Строка, ПрефиксПараметра, ОбластиМакета, СимволПоУмолчанию);
КонецПроцедуры

Процедура ВывестиСтрокуНаПечать(Строка, ПрефиксПараметра, ОбластиМакета, СимволПоУмолчанию = "") Экспорт 
	ДлинаСтроки = СтрДлина(Строка);
	Индекс = 1;
	
	Пока Истина Цикл 
		ИмяПараметра = ПрефиксПараметра + "_" + Формат(Индекс, "ЧГ=");
		Обл = ОбластиМакета.Найти(ИмяПараметра);
		Если Обл = Неопределено Тогда 
			Прервать;
		КонецЕсли;
		
		Если Индекс > ДлинаСтроки Тогда 
			Если ЗначениеЗаполнено(СимволПоУмолчанию) Тогда 
				Обл.Текст = СимволПоУмолчанию;
				Индекс = Индекс + 1;
			Иначе 
				Прервать;
			КонецЕсли;
		Иначе 
			Обл.Текст = Сред(Строка, Индекс, 1);
			Индекс = Индекс + 1;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура ВывестиЧислоНаПечать(знач Число, ПрефиксПараметра, ОбластиМакета) Экспорт
	Число = ?(ЗначениеЗаполнено(Число), Число, 0);
	Инд = 1;
	ИмяПараметра = ПрефиксПараметра + "_1";
	Область = ОбластиМакета.Найти(ИмяПараметра);
	ЗнаковПослеЗапятой = 0;
	
	Если Область = Неопределено 
		Или Область.Лево <> Область.Право Тогда 
		Возврат;
	КонецЕсли;
	
	Координата = Область.Лево;
	
	Пока Истина Цикл 
		Инд = Инд + 1;
		ИмяПараметра = ПрефиксПараметра + "_" + Инд;
		Область = ОбластиМакета.Найти(ИмяПараметра);
		Если Область = Неопределено 
			Или Область.Лево <> Область.Право Тогда 
			Прервать;
		КонецЕсли;
		
		Если ЗнаковПослеЗапятой > 0 
			Или Область.Лево > Координата + 1 Тогда 
			
			ЗнаковПослеЗапятой = ЗнаковПослеЗапятой + 1;
		КонецЕсли;
		
		Координата = Координата + 1;
	КонецЦикла;
	
	Если Число = 0 Тогда 
		Ч = "0" + Прав(Формат(Pow(10, ЗнаковПослеЗапятой), "ЧГ="), ЗнаковПослеЗапятой);
		Ч = Прав("                                " + Ч, Инд - 1);
	Иначе 
		Ч = Формат(Цел(Число * Pow(10, ЗнаковПослеЗапятой)), "ЧГ=");
		Если СтрДлина(Ч) < ЗнаковПослеЗапятой + 1 Тогда
			Ч = Прав("000000000000000000000000000000" + Ч, ЗнаковПослеЗапятой + 1);
		КонецЕсли;
		Ч = Прав("                                " + Ч, Инд - 1);
	КонецЕсли;
	ВывестиСтрокуНаПечать(Ч, ПрефиксПараметра, ОбластиМакета);
КонецПроцедуры

Процедура ВывестиЧислоСПрочеркамиНаПечать(Знач Число, ПрефиксПараметра, ОбластиМакета) Экспорт
	Число = ?(ЗначениеЗаполнено(Число), Число, 0);
	Инд = 1;
	ИмяПараметра = ПрефиксПараметра + "_1";
	Область = ОбластиМакета.Найти(ИмяПараметра);
	ЗнаковПослеЗапятой = 0;
	ЗнаковДоЗапятой = 1;
	
	Если Область = Неопределено 
		Или Область.Лево <> Область.Право Тогда 
		Возврат;
	КонецЕсли;
	
	Координата = Область.Лево;
	
	Пока Истина Цикл 
		Инд = Инд + 1;
		ИмяПараметра = ПрефиксПараметра + "_" + Инд;
		Область = ОбластиМакета.Найти(ИмяПараметра);
		Если Область = Неопределено 
			Или Область.Лево <> Область.Право Тогда 
			Прервать;
		КонецЕсли;
		
		ЗнаковДоЗапятой = ЗнаковДоЗапятой + 1;
		Если ЗнаковПослеЗапятой > 0 
			Или Область.Лево > Координата + 1 Тогда 
			
			ЗнаковПослеЗапятой = ЗнаковПослеЗапятой + 1;
			ЗнаковДоЗапятой = ЗнаковДоЗапятой - 1;
		КонецЕсли;
		
		Координата = Координата + 1;
	КонецЦикла;
	
	Если Число = 0 Тогда 
		Ч = "-------------------------------------------------";
	Иначе
		Ч = Лев(Формат(Цел(Число), "ЧН=0; ЧГ=") + "-------------------------------------------------", ЗнаковДоЗапятой);
		Ч2 = Прав("00000000000000000000000000000000000000000000" + Формат(   (Число - Цел(Число)) * Pow(10, ЗнаковПослеЗапятой), "ЧГ="), ЗнаковПослеЗапятой);
		Пока Прав(Ч2, 1) = "0" Цикл 
			Ч2 = Лев(Ч2, СтрДлина(Ч2) - 1);
		КонецЦикла;
		Ч = Ч + Ч2 + "-------------------------------------------------";
	КонецЕсли;
	УведомлениеОСпецрежимахНалогообложения.ВывестиСтрокуНаПечать(Ч, ПрефиксПараметра, ОбластиМакета);
КонецПроцедуры

Процедура ВывестиДатуНаПечать(Дата, ПрефиксПараметра, ОбластиМакета, СимволПоУмолчанию = "") Экспорт 
	Если Не ЗначениеЗаполнено(Дата) 
		И ЗначениеЗаполнено(СимволПоУмолчанию)
		И ОбластиМакета.Найти(ПрефиксПараметра + "_1") <> Неопределено Тогда 
		
		Для Инд = 1 По 8 Цикл 
			ОбластиМакета[ПрефиксПараметра + "_" + Инд].Текст = СимволПоУмолчанию;
		КонецЦикла;
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Дата) Или ОбластиМакета.Найти(ПрефиксПараметра + "_1") = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	День = День(Дата);
	Месяц = Месяц(Дата);
	Год = Год(Дата);
	
	Если День < 10 Тогда
		ОбластиМакета[ПрефиксПараметра + "_1"].Текст = "0";
		ОбластиМакета[ПрефиксПараметра + "_2"].Текст = "" + День;
	Иначе
		ОбластиМакета[ПрефиксПараметра + "_1"].Текст = "" + Цел(День/10);
		ОбластиМакета[ПрефиксПараметра + "_2"].Текст = "" + День%10;
	КонецЕсли;
	
	Если Месяц < 10 Тогда
		ОбластиМакета[ПрефиксПараметра + "_3"].Текст = "0";
		ОбластиМакета[ПрефиксПараметра + "_4"].Текст = "" + Месяц;
	Иначе
		ОбластиМакета[ПрефиксПараметра + "_3"].Текст = "1";
		ОбластиМакета[ПрефиксПараметра + "_4"].Текст = "" + (Месяц - 10);
	КонецЕсли;
	
	ГТ = Цел(Год/1000);
	ГС = Цел((Год%1000)/100);
	ГД = Цел((Год%100)/10);
	ГЕ = Год%10;
	
	ОбластиМакета[ПрефиксПараметра + "_5"].Текст = "" + ГТ;
	ОбластиМакета[ПрефиксПараметра + "_6"].Текст = "" + ГС;
	ОбластиМакета[ПрефиксПараметра + "_7"].Текст = "" + ГД;
	ОбластиМакета[ПрефиксПараметра + "_8"].Текст = "" + ГЕ;
КонецПроцедуры

Процедура ВывестиОКВЭДНаПечать(ОКВЭД, ПрефиксПараметра, ОбластиМакета) Экспорт 
	Подстроки = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ОКВЭД, ".");
	Подстроки.Добавить("");
	Подстроки.Добавить("");
	Подстроки.Добавить("");
	Подстроки[0] = Прав("   " + Подстроки[0], 2);
	Подстроки[1] = Лев(Подстроки[1]+"   ", 2);
	Подстроки[2] = Лев(Подстроки[2]+"   ", 2);
	
	ВывестиСтрокуНаПечать(Подстроки[0]+Подстроки[1]+Подстроки[2], ПрефиксПараметра, ОбластиМакета);
КонецПроцедуры

Функция НовыйПустойЛист() Экспорт 
	ПечатнаяФорма = Новый ТабличныйДокумент;
	ПечатнаяФорма.ОтображатьЗаголовки = Ложь;
	ПечатнаяФорма.ОтображатьСетку     = Ложь;
	ПечатнаяФорма.ЧерноБелыйПросмотр  = Истина;
	ПечатнаяФорма.ЧерноБелаяПечать    = Истина;
	ПечатнаяФорма.Автомасштаб         = Истина;
	ПечатнаяФорма.ПолеСверху = 5;
	ПечатнаяФорма.ПолеСправа = 5;
	ПечатнаяФорма.ПолеСнизу  = 5;
	ПечатнаяФорма.ПолеСлева  = 5;
	ПечатнаяФорма.ОриентацияСтраницы  = ОриентацияСтраницы.Портрет;
	Возврат ПечатнаяФорма;
КонецФункции

Процедура ПоложитьПФВСписокЛистов(Объект, Листы, ПечатнаяФорма, НомСтр, ВыводитьТолькоЗаполненые = Истина) Экспорт 
	Если ВыводитьТолькоЗаполненые Тогда 
		ПФЗаполнена = Ложь;
		Для Каждого Параметр Из ПечатнаяФорма.Параметры Цикл 
			Если ЗначениеЗаполнено(Параметр) Тогда 
				ПФЗаполнена = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Для Каждого Обл Из ПечатнаяФорма.Области Цикл 
			Если ПФЗаполнена Тогда 
				Прервать;
			КонецЕсли;
			
			Если СтрНачинаетсяС(НРег(Обл.Имя), "номстр_") Тогда 
				Продолжить;
			КонецЕсли;
			
			ПФЗаполнена = ЗначениеЗаполнено(Обл.Текст);
		КонецЦикла;
	Иначе
		ПФЗаполнена = Истина;
	КонецЕсли;
	
	Если Не ПФЗаполнена Тогда 
		НомСтр = НомСтр - 1;
		ПечатнаяФорма = НовыйПустойЛист();
		Возврат;
	КонецЕсли;
	
	Лист = Новый Массив;
	Лист.Добавить(ПоместитьВоВременноеХранилище(ПечатнаяФорма));
	Лист.Добавить(Новый УникальныйИдентификатор);
	Лист.Добавить("Лист " + НомСтр);
	Листы.Добавить(Лист, "Лист " + НомСтр);
	
	ПечатнаяФорма = НовыйПустойЛист();
КонецПроцедуры

Процедура НачальныеОперацииСМногострочнымиБлоками(Форма) Экспорт
	Для Каждого Стр Из Форма.ДеревоСтраниц.ПолучитьЭлементы() Цикл
		Если Стр.Многострочность Тогда
			Для Каждого Мнг Из Стр.МногострочныеЧасти Цикл
				Форма[Мнг.Значение].Очистить();
				Форма[Мнг.Значение].Добавить();
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Функция СтраницаЗаполнена(Данные) Экспорт 
	Для Каждого КЗ Из Данные Цикл
		Если ТипЗнч(КЗ.Значение) = Тип("УникальныйИдентификатор") Тогда 
			Продолжить;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(КЗ.Значение) Тогда 
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
КонецФункции

Функция МногострочнаяЧастьЗаполнена(Данные) Экспорт 
	Колонки = Данные.Колонки;
	Для Каждого Стр Из Данные Цикл 
		Для Каждого Колонка Из Данные.Колонки Цикл 
			Если ЗначениеЗаполнено(Стр[Колонка.Имя]) Тогда 
				Возврат Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Возврат Ложь;
КонецФункции

Процедура ЗаполнитьТаблицуФорматов(Форма, ИмяМакета) Экспорт
	Разложение = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Форма.ИмяФормы, ".");
	МакетФорматов = Отчеты[Разложение[1]].ПолучитьМакет(ИмяМакета);
	ТЧ = Новый ОписаниеТипов("Число");
	
	Стр = 0;
	Пока Истина Цикл 
		Стр = Стр + 1;
		ИДСтраницы = МакетФорматов.Область(Стр, 1, Стр, 1).Текст;
		Поле = МакетФорматов.Область(Стр, 2, Стр, 2).Текст;
		Всего = ТЧ.ПривестиЗначение(МакетФорматов.Область(Стр, 3, Стр, 3).Текст);
		ПослеЗапятой = ТЧ.ПривестиЗначение(МакетФорматов.Область(Стр, 4, Стр, 4).Текст);
		Неотрицательный = ЗначениеЗаполнено(МакетФорматов.Область(Стр, 5, Стр, 5).Текст);
		
		Если Не ЗначениеЗаполнено(ИДСтраницы) Или Не ЗначениеЗаполнено(Поле)
			Или Не ЗначениеЗаполнено(Всего) Или Не ЗначениеЗаполнено(ПослеЗапятой) Тогда 
			Прервать;
		КонецЕсли;
		
		НовСтр = Форма.ЧисловыеФорматы.Добавить();
		НовСтр.ИДСтраницы = ИДСтраницы;
		НовСтр.Поле = Поле;
		НовСтр.Всего = Всего;
		НовСтр.ПослеЗапятой = ПослеЗапятой;
		НовСтр.Неотрицательный = Неотрицательный;
	КонецЦикла;
КонецПроцедуры

Процедура УстановитьФорматыВПолях(Форма) Экспорт
	ПоляСФорматами = Форма.ЧисловыеФорматы.НайтиСтроки(Новый Структура("ИДСтраницы", Форма.ТекущееИДНаименования));
	Для Каждого Стр Из ПоляСФорматами Цикл 
		Знак = ?(Стр.Неотрицательный, ДопустимыйЗнак.Неотрицательный, ДопустимыйЗнак.Любой);
		ОТ = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(Стр.Всего, Стр.ПослеЗапятой, Знак));
		Обл = Форма.ПредставлениеУведомления.Области.Найти(Стр.Поле);
		Если Обл <> Неопределено Тогда 
			Обл.ТипЗначения = ОТ;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Функция ДобавитьСтраницуУведомления(Форма) Экспорт
	ТекущийЭлемент = НайтиЭлементПоУИДВДереве(Форма.ДеревоСтраниц.ПолучитьЭлементы(), Форма.УИДТекущаяСтраница);
	Если ТекущийЭлемент <> Неопределено Тогда 
		НовСтр = СкопироватьСтрокуВДереве(Форма, ТекущийЭлемент);
		ПеренумероватьЭлементы(НовСтр.ПолучитьРодителя());
		Возврат НовСтр.ПолучитьИдентификатор();
	КонецЕсли;
	
	Возврат Неопределено;
КонецФункции

Функция НайтиЭлементПоУИДВДереве(Элементы, УИД)
	Для Каждого Элт Из Элементы Цикл 
		Рез = НайтиЭлементПоУИДВДереве(Элт.ПолучитьЭлементы(), УИД);
		Если Рез <> Неопределено Тогда 
			Возврат Рез;
		КонецЕсли;
		Если Элт.УИД = УИД Тогда 
			Возврат Элт;
		КонецЕсли;
	КонецЦикла;
КонецФункции

Процедура УдалитьСтруктурыДанных(Форма, СтрокаДляУдаления)
	Для Каждого Стр Из СтрокаДляУдаления.ПолучитьЭлементы() Цикл 
		УдалитьСтруктурыДанных(Форма, Стр);
	КонецЦикла;
	
	Если ЗначениеЗаполнено(СтрокаДляУдаления.ИДНаименования) Тогда
		ДанныеМногостраничнойЧасти = Форма.ДанныеМногостраничныхРазделов[СтрокаДляУдаления.ИДНаименования];
		Для Каждого Стр Из ДанныеМногостраничнойЧасти Цикл 
			Если Стр.Значение.УИД = СтрокаДляУдаления.УИД Тогда 
				ДанныеМногостраничнойЧасти.Удалить(Стр);
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Функция УдалитьСтраницуНаСервере(Форма) Экспорт
	ТекущийЭлемент = НайтиЭлементПоУИДВДереве(Форма.ДеревоСтраниц.ПолучитьЭлементы(), Форма.УИДТекущаяСтраница);
	Если ТекущийЭлемент <> Неопределено Тогда
		Родитель = ТекущийЭлемент.ПолучитьРодителя();
		Если Родитель.ПолучитьЭлементы().Количество() = 1 Тогда
			ДобавитьСтраницуУведомления(Форма);
			ПослеУдаления = Родитель.ПолучитьЭлементы()[1];
		Иначе
			ПослеУдаления = Родитель.ПолучитьЭлементы()[0];
			Если ПослеУдаления = ТекущийЭлемент Тогда
				ПослеУдаления = Родитель.ПолучитьЭлементы()[1];
			Иначе
				Для Каждого Стр Из Родитель.ПолучитьЭлементы() Цикл 
					Если Стр = ТекущийЭлемент Тогда 
						Прервать;
					КонецЕсли;
					ПослеУдаления = Стр;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
		
		УдалитьСтруктурыДанных(Форма, ТекущийЭлемент);
		Родитель.ПолучитьЭлементы().Удалить(ТекущийЭлемент);
		ПеренумероватьЭлементы(Родитель);
		Возврат ПослеУдаления.ПолучитьИдентификатор();
	КонецЕсли;
	
	Возврат Неопределено;
КонецФункции

Процедура ПечатьУведомленияБРО(Форма) Экспорт
	Форма.СохранитьДанные();
	Разложение = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Форма.ИмяФормы, ".");
	Форма.СтруктураРеквизитовУведомления = Новый Структура("СписокПечатаемыхЛистов", Отчеты[Разложение[1]].СформироватьСписокЛистов(Форма.Объект));
КонецПроцедуры

Функция СкопироватьСтрокуВДереве(Форма, Источник)
	Родитель = Источник.ПолучитьРодителя();
	Приемник = Родитель.ПолучитьЭлементы().Добавить();
	СкопироватьСтрокуВДеревеРек(Форма, Источник, Приемник);
	Возврат Приемник;
КонецФункции

Процедура СкопироватьСтрокуВДеревеРек(Форма, Источник, Приемник)
	ЗаполнитьЗначенияСвойств(Приемник, Источник);
	Если ЗначениеЗаполнено(Приемник.ИДНаименования) Тогда 
		Приемник.УИД = Новый УникальныйИдентификатор;
		СЗ = Форма.ДанныеМногостраничныхРазделов[Приемник.ИДНаименования];
		СтруктураНовСтр = Новый Структура;
		Для Каждого КЗ Из СЗ.Получить(0).Значение Цикл 
			СтруктураНовСтр.Вставить(КЗ.Ключ);
		КонецЦикла;
		СтруктураНовСтр.Вставить("УИД", Приемник.УИД);
		СтруктураНовСтр.Вставить("УИДРодителя", ПолучитьУИДРодителя(Приемник));
		СЗ.Добавить(СтруктураНовСтр);
	КонецЕсли;
	
	СтрокиДляКопирования = ПолучитьСписокСтрокДляКопирования(Форма, Источник);
	Для Каждого Стр Из СтрокиДляКопирования Цикл 
		НовСтр = Приемник.ПолучитьЭлементы().Добавить();
		СкопироватьСтрокуВДеревеРек(Форма, Стр, НовСтр);
	КонецЦикла;
	
	Если Не ЗначениеЗаполнено(Приемник.ИДНаименования) Тогда
		Приемник.УИД = Приемник.ПолучитьЭлементы()[0].УИД;
	КонецЕсли;
КонецПроцедуры

Функция ПолучитьСписокСтрокДляКопирования(Форма, Источник)
	СЗ = Новый Массив;
	ВсеТипыПодчиненныхЛистов = Новый Соответствие;
	
	Если Источник.ПолучитьЭлементы().Количество() > 0 Тогда 
		Для Каждого Стр Из Источник.ПолучитьЭлементы() Цикл 
			Если ЗначениеЗаполнено(Стр.ИДНаименования) Тогда 
				ВсеТипыПодчиненныхЛистов.Вставить(Стр.ИДНаименования);
			КонецЕсли;
		КонецЦикла;
		
		Для Каждого Стр Из Источник.ПолучитьЭлементы() Цикл
			Если ЗначениеЗаполнено(Стр.ИДНаименования) Тогда 
				Если ВсеТипыПодчиненныхЛистов[Стр.ИДНаименования] = Неопределено Тогда 
					ВсеТипыПодчиненныхЛистов[Стр.ИДНаименования] = 1;
					СЗ.Добавить(Стр);
				КонецЕсли;
			Иначе
				СЗ.Добавить(Стр);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Возврат СЗ;
КонецФункции

Функция ПолучитьУИДРодителя(Строка) Экспорт 
	Если ТипЗнч(Строка) = Тип("СтрокаДереваЗначений") Тогда 
		Родитель = Строка.Родитель;
	Иначе 
		Родитель = Строка.ПолучитьРодителя();
	КонецЕсли;
	
	Если Родитель = Неопределено Тогда 
		Возврат Неопределено;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Родитель.ИДНаименования) Тогда 
		Возврат Родитель.УИД;
	КонецЕсли;
	
	Возврат ПолучитьУИДРодителя(Родитель);
КонецФункции

Процедура ПеренумероватьЭлементы(Корень)
	Если Не ЗначениеЗаполнено(Корень.ИДНаименования) Тогда 
		Инд = 0;
		Для Каждого Стр Из Корень.ПолучитьЭлементы() Цикл 
			Инд = Инд + 1;
			Стр.Наименование = "Стр. " + Инд;
		КонецЦикла;
	КонецЕсли;
	
	Для Каждого Стр Из Корень.ПолучитьЭлементы() Цикл 
		ПеренумероватьЭлементы(Стр);
	КонецЦикла;
КонецПроцедуры

Функция ПолучитьИдентификаторыДляСворачивания(Форма) Экспорт 
	Результат = Новый Массив;
	ДеревоСтраниц = Форма.ДеревоСтраниц;
	
	Для Каждого ТекущаяСтрока Из ДеревоСтраниц.ПолучитьЭлементы() Цикл
		Если ТекущаяСтрока.ПолучитьЭлементы().Количество() = 0 Тогда 
			Продолжить;
		КонецЕсли;
		
		ДанныйПодразделПустРек(Форма, ТекущаяСтрока, Результат);
	КонецЦикла;
	
	Возврат Результат;
КонецФункции

Функция ДанныйПодразделПустРек(Форма, ТекущаяСтрока, Результат)
	ПодразделПуст = Истина;
	
	Если ЗначениеЗаполнено(ТекущаяСтрока.ИДНаименования) Тогда 
		Если ТекущаяСтрока.Многостраничность Тогда
			СтрДанных = Неопределено;
			Для Каждого Элт Из Форма.ДанныеМногостраничныхРазделов[ТекущаяСтрока.ИДНаименования] Цикл 
				Если Элт.Значение.УИД = ТекущаяСтрока.УИД Тогда 
					СтрДанных = Элт.Значение;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		ИначеЕсли ТекущаяСтрока.Многострочность Тогда
			СтрДанных = Форма.ДанныеУведомления[ТекущаяСтрока.ИДНаименования];
			ПодразделПуст = МногострочнаяЧастьЗаполнена(ТекущаяСтрока.МногострочныеЧасти)
		Иначе
			СтрДанных = Форма.ДанныеУведомления[ТекущаяСтрока.ИДНаименования];
		КонецЕсли;
		
		Если ТипЗнч(СтрДанных) = Тип("Структура") Тогда 
			ПодразделПуст = ПодразделПуст И (Не СтраницаЗаполнена(СтрДанных));
		Иначе
			ПодразделПуст = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Для Каждого Стр Из ТекущаяСтрока.ПолучитьЭлементы() Цикл 
		ПодразделПуст = ДанныйПодразделПустРек(Форма, Стр, Результат) И ПодразделПуст;
	КонецЦикла;
	
	Если ПодразделПуст И ТекущаяСтрока.ПолучитьЭлементы().Количество() > 0 Тогда
		Результат.Добавить(ТекущаяСтрока.ПолучитьИдентификатор());
	КонецЕсли;
	
	Возврат ПодразделПуст;
КонецФункции

Процедура НачальныеОперацииПриСозданииНаСервере(Форма) Экспорт
	Если Не ЗначениеЗаполнено(Форма.Объект.Ссылка) Тогда
		Форма.Объект.ДатаПодписи = ТекущаяДатаСеанса();
		Форма.Заголовок = Форма.Заголовок + " (создание)";
	КонецЕсли;
	
	Разложение = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Форма.ИмяФормы, ".");
	Форма.Объект.ИмяФормы = Разложение[3];
	Форма.Объект.ИмяОтчета = Разложение[1];
	РегламентированнаяОтчетность.ДобавитьКнопкуПрисоединенныеФайлы(Форма);
	РегламентированнаяОтчетностьКлиентСервер.ПриИнициализацииФормыРегламентированногоОтчета(Форма);
	ЭлектронныйДокументооборотСКонтролирующимиОрганами.ОтметитьКакПрочтенное(Форма.Объект.Ссылка);
	ЗагрузитьНастройкиРучногоВвода(Форма);
	
	Если ЗначениеЗаполнено(Форма.Объект.Ссылка) Тогда 
		ЗаблокироватьДанныеДляРедактирования(Форма.Объект.Ссылка, , Форма.УникальныйИдентификатор);
	КонецЕсли;
КонецПроцедуры

Процедура СформироватьМакетПростойФормы(Форма, ИмяМакета, ПредставлениеУведомления) Экспорт 
	Форма[ПредставлениеУведомления].Очистить();
	МакетДокумента = Отчеты[СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Форма.ИмяФормы, ".")[1]].ПолучитьМакет(ИмяМакета);
	СформироватьСтруктуруДанныхПростогоУведомления(Форма, МакетДокумента);
	Форма[ПредставлениеУведомления].Вывести(МакетДокумента);
КонецПроцедуры

Процедура СформироватьСтруктуруДанныхПростогоУведомления(Форма, ПредставлениеУведомления)
	Форма.ДанныеУведомления = Новый Структура;
	Для Каждого Обл Из ПредставлениеУведомления.Области Цикл 
		Если Обл.ТипОбласти = ТипОбластиЯчеекТабличногоДокумента.Прямоугольник 
			И Обл.СодержитЗначение Тогда 
			
			Форма.ДанныеУведомления.Вставить(Обл.Имя);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура ЗагрузитьДанныеПростогоУведомления(Форма, ДанныеДляЗагрузки, ТабДок) Экспорт
	Для Каждого КЗ Из ДанныеДляЗагрузки Цикл
		Обл = ТабДок.Области.Найти(КЗ.Ключ);
		Если Обл <> Неопределено Тогда 
			Обл.Значение = КЗ.Значение;
			Форма.ДанныеУведомления.Вставить(КЗ.Ключ, КЗ.Значение);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура ЗагрузитьНастройкиРучногоВвода(Форма)
	Попытка
		Форма.РучнойВвод = Ложь;
		ТекущиеНастройки = ХранилищеСистемныхНастроек.Загрузить("СообщенияВКонтролирующиеОрганы.Регистрация", "ВводДанныхВручную");
		
		Если ТипЗнч(ТекущиеНастройки) = Тип("Булево") Тогда 
			Форма.РучнойВвод = ТекущиеНастройки;
		КонецЕсли;
	Исключение
		ТекущиеНастройки = Неопределено;
	КонецПопытки;
КонецПроцедуры

Процедура СохранитьНастройкиРучногоВвода(Форма) Экспорт 
	ХранилищеСистемныхНастроек.Сохранить("СообщенияВКонтролирующиеОрганы.Регистрация", "ВводДанныхВручную", Форма.РучнойВвод);
КонецПроцедуры

Процедура СформироватьКонтейнерДанныхУведомления(КонтейнерВходящий, КонтейнерРезультат, ЕстьМногостраничность = Ложь) Экспорт 
	КонтейнерРезультат.Вставить("ДанныеУведомления", Новый Структура);
	Если ЕстьМногостраничность Тогда
		КонтейнерРезультат.Вставить("ДанныеМногостраничныхРазделов", Новый Структура);
	КонецЕсли;
	Разложение = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(КонтейнерВходящий.ИмяФормы, ".");
	
	Для Каждого Стр Из КонтейнерВходящий.ДеревоСтраниц.Строки Цикл
		Если Стр.Многостраничность Тогда 
			Если Стр.Многострочность Тогда
				// пока пусто
			Иначе
				МнгСтр = Стр.Строки[0];
				
				СтруктураМногостраничнойСтраницы = Новый Структура("УИД", МнгСтр.УИД);
				МакетДокумента = Отчеты[Разложение[1]].ПолучитьМакет(МнгСтр.ИмяМакета);
				Для Каждого Обл Из МакетДокумента.Области Цикл 
					Если Обл.ТипОбласти = ТипОбластиЯчеекТабличногоДокумента.Прямоугольник 
						И Обл.СодержитЗначение Тогда 
						
						СтруктураМногостраничнойСтраницы.Вставить(Обл.Имя);
					КонецЕсли;
				КонецЦикла;
				
				Если МнгСтр.Строки.Количество() > 0 Тогда
					СформироватьКонтейнерДанныхУведомленияРек(КонтейнерВходящий, КонтейнерРезультат, Разложение[1], МнгСтр);
				КонецЕсли;
				
				СЗ = Новый СписокЗначений;
				СЗ.Добавить(СтруктураМногостраничнойСтраницы);
				КонтейнерРезультат.ДанныеМногостраничныхРазделов.Вставить(МнгСтр.ИДНаименования, СЗ);
			КонецЕсли;
		Иначе
			Если Стр.Многострочность Тогда
				ОбластиВМногостраничнойЧасти = Новый Соответствие;
				МакетДокумента = Отчеты[Разложение[1]].ПолучитьМакет(Стр.ИмяМакета);
				Для Каждого Мнг Из Стр.МногострочныеЧасти Цикл
					Для Каждого Обл Из МакетДокумента.ПолучитьОбласть(Мнг.Значение).Области Цикл 
						Если Обл.ТипОбласти = ТипОбластиЯчеекТабличногоДокумента.Прямоугольник 
							И Обл.СодержитЗначение Тогда 
							
							ОбластиВМногостраничнойЧасти.Вставить(Обл.Имя, Истина);
						КонецЕсли;
					КонецЦикла;
				КонецЦикла;
				
				СтруктураСтраницы = Новый Структура;
				МакетДокумента = Отчеты[Разложение[1]].ПолучитьМакет(Стр.ИмяМакета);
				Для Каждого Обл Из МакетДокумента.Области Цикл 
					Если Обл.ТипОбласти = ТипОбластиЯчеекТабличногоДокумента.Прямоугольник 
						И Обл.СодержитЗначение
						И ОбластиВМногостраничнойЧасти[Обл.Имя] = Неопределено Тогда 
						
						СтруктураСтраницы.Вставить(Обл.Имя);
					КонецЕсли;
				КонецЦикла;
				КонтейнерРезультат.ДанныеУведомления.Вставить(Стр.ИДНаименования, СтруктураСтраницы);
			Иначе
				СтруктураСтраницы = Новый Структура;
				МакетДокумента = Отчеты[Разложение[1]].ПолучитьМакет(Стр.ИмяМакета);
				Для Каждого Обл Из МакетДокумента.Области Цикл 
					Если Обл.ТипОбласти = ТипОбластиЯчеекТабличногоДокумента.Прямоугольник 
						И Обл.СодержитЗначение Тогда 
						
						СтруктураСтраницы.Вставить(Обл.Имя);
					КонецЕсли;
				КонецЦикла;
				КонтейнерРезультат.ДанныеУведомления.Вставить(Стр.ИДНаименования, СтруктураСтраницы);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура СформироватьКонтейнерДанныхУведомленияРек(КонтейнерВходящий, КонтейнерРезультат, ИмяОтчета, Строка)
	Для Каждого ПодчМнг Из Строка.Строки Цикл
		Если ПодчМнг.Строки.Количество() > 0 Тогда
			СформироватьКонтейнерДанныхУведомленияРек(КонтейнерВходящий, КонтейнерРезультат, ИмяОтчета, ПодчМнг);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ПодчМнг.ИДНаименования) Тогда 
			СтруктураМногостраничнойСтраницыПодч = Новый Структура("УИД, УИДРодителя", ПодчМнг.УИД, ПолучитьУИДРодителя(ПодчМнг));
			МакетДокумента = Отчеты[ИмяОтчета].ПолучитьМакет(ПодчМнг.ИмяМакета);
			Для Каждого Обл Из МакетДокумента.Области Цикл 
				Если Обл.ТипОбласти = ТипОбластиЯчеекТабличногоДокумента.Прямоугольник 
					И Обл.СодержитЗначение Тогда 
					
					СтруктураМногостраничнойСтраницыПодч.Вставить(Обл.Имя);
				КонецЕсли;
			КонецЦикла;
			
			СЗ = Новый СписокЗначений;
			СЗ.Добавить(СтруктураМногостраничнойСтраницыПодч);
			КонтейнерРезультат.ДанныеМногостраничныхРазделов.Вставить(ПодчМнг.ИДНаименования, СЗ);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура НачальныеОперацииСКонтейнеромМногострочныхБлоков(КонтейнерВходящий, КонтейнерРезультат) Экспорт
	Для Каждого Стр Из КонтейнерВходящий.ДеревоСтраниц.Строки Цикл
		Если Стр.Многострочность Тогда
			Для Каждого Мнг Из Стр.МногострочныеЧасти Цикл
				ТЗ = Новый ТаблицаЗначений;
				ТЗ.Колонки.Добавить("А01020000", Новый ОписаниеТипов("Строка"));
				ТЗ.Добавить();
				КонтейнерРезультат.Вставить(Мнг.Значение, ТЗ);
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура СформироватьСтруктуруДанныхУведомленияРекНовогоОбразца(Форма, ИмяОтчета, Строка)
	Для Каждого ПодчМнг Из Строка.ПолучитьЭлементы() Цикл
		Если ПодчМнг.ПолучитьЭлементы().Количество() > 0 Тогда
			СформироватьСтруктуруДанныхУведомленияРекНовогоОбразца(Форма, ИмяОтчета, ПодчМнг);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ПодчМнг.ИДНаименования) Тогда
			Если ПодчМнг.Многострочность Тогда
				Для Каждого МногострочныйЭлемент Из ПодчМнг.МногострочныеЧасти Цикл
					ТЗ = Новый ТаблицаЗначений;
					ТЗ.Колонки.Добавить("УИД");
					СтрокаДанных = Новый Структура;
					МакетМногострочки = Отчеты[ИмяОтчета].ПолучитьМакет(ПодчМнг.ИмяМакета).ПолучитьОбласть("Str_"+МногострочныйЭлемент.Значение);
					Для Каждого Обл Из МакетМногострочки.Области Цикл 
						Если Обл.ТипОбласти = ТипОбластиЯчеекТабличногоДокумента.Прямоугольник 
							И Обл.СодержитЗначение Тогда 
							
							ТЗ.Колонки.Добавить(Обл.Имя);
							СтрокаДанных.Вставить(Обл.Имя);
						КонецЕсли;
					КонецЦикла;
					
					Форма.ДанныеДопСтрок.Вставить(МногострочныйЭлемент.Значение, ПоместитьВоВременноеХранилище(ТЗ, Новый УникальныйИдентификатор));
					СЗ = Новый СписокЗначений;
					СЗ.Добавить(СтрокаДанных);
					Форма.ДанныеДопСтрокСтраницы.Вставить(МногострочныйЭлемент.Значение, СЗ);
				КонецЦикла;
			КонецЕсли;
			
			СтруктураМногостраничнойСтраницыПодч = Новый Структура("УИД, УИДРодителя", ПодчМнг.УИД, УведомлениеОСпецрежимахНалогообложения.ПолучитьУИДРодителя(ПодчМнг));
			МакетДокумента = Отчеты[ИмяОтчета].ПолучитьМакет(ПодчМнг.ИмяМакета);
			Для Каждого Обл Из МакетДокумента.Области Цикл 
				Если Обл.ТипОбласти = ТипОбластиЯчеекТабличногоДокумента.Прямоугольник 
					И Обл.СодержитЗначение Тогда 
					
					СтруктураМногостраничнойСтраницыПодч.Вставить(Обл.Имя);
				КонецЕсли;
			КонецЦикла;
			
			СЗ = Новый СписокЗначений;
			СЗ.Добавить(СтруктураМногостраничнойСтраницыПодч);
			Форма.ДанныеМногостраничныхРазделов.Вставить(ПодчМнг.ИДНаименования, СЗ);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура СформироватьСтруктуруДанныхУведомленияНовогоОбразца(Форма) Экспорт 
	Форма.ДанныеУведомления = Новый Структура;
	Форма.ДанныеМногостраничныхРазделов = Новый Структура;
	Форма.ДанныеДопСтрок = Новый Структура;
	Форма.ДанныеДопСтрокСтраницы = Новый Структура;
	Форма.ИдентификаторыОбычныхСтраниц = Новый Структура;
	
	Разложение = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Форма.ИмяФормы, ".");
	
	Для Каждого Стр Из Форма.ДеревоСтраниц.ПолучитьЭлементы() Цикл
		Если Стр.Многостраничность Тогда 
			Если Стр.Многострочность Тогда
				МнгСтр = Стр.ПолучитьЭлементы()[0];
				
				СтруктураМногостраничнойСтраницы = Новый Структура("УИД", МнгСтр.УИД);
				МакетДокумента = Отчеты[Разложение[1]].ПолучитьМакет(МнгСтр.ИмяМакета).ПолучитьОбласть("ОсновнаяЧасть");
				Для Каждого Обл Из МакетДокумента.Области Цикл 
					Если Обл.ТипОбласти = ТипОбластиЯчеекТабличногоДокумента.Прямоугольник 
						И Обл.СодержитЗначение Тогда 
						
						СтруктураМногостраничнойСтраницы.Вставить(Обл.Имя);
					КонецЕсли;
				КонецЦикла;
				
				Если МнгСтр.ПолучитьЭлементы().Количество() > 0 Тогда
					СформироватьСтруктуруДанныхУведомленияРекНовогоОбразца(Форма, Разложение[1], МнгСтр);
				КонецЕсли;
				
				СЗ = Новый СписокЗначений;
				СЗ.Добавить(СтруктураМногостраничнойСтраницы);
				Форма.ДанныеМногостраничныхРазделов.Вставить(МнгСтр.ИДНаименования, СЗ);
				
				Для Каждого МногострочныйЭлемент Из МнгСтр.МногострочныеЧасти Цикл
					ТЗ = Новый ТаблицаЗначений;
					ТЗ.Колонки.Добавить("УИД");
					СтрокаДанных = Новый Структура;
					МакетМногострочки = Отчеты[Разложение[1]].ПолучитьМакет(МнгСтр.ИмяМакета).ПолучитьОбласть("Str_"+МногострочныйЭлемент.Значение);
					Для Каждого Обл Из МакетМногострочки.Области Цикл 
						Если Обл.ТипОбласти = ТипОбластиЯчеекТабличногоДокумента.Прямоугольник 
							И Обл.СодержитЗначение Тогда 
							
							ТЗ.Колонки.Добавить(Обл.Имя);
							СтрокаДанных.Вставить(Обл.Имя);
						КонецЕсли;
					КонецЦикла;
					
					Форма.ДанныеДопСтрок.Вставить(МногострочныйЭлемент.Значение, ПоместитьВоВременноеХранилище(ТЗ, Новый УникальныйИдентификатор));
					СЗ = Новый СписокЗначений;
					СЗ.Добавить(СтрокаДанных);
					Форма.ДанныеДопСтрокСтраницы.Вставить(МногострочныйЭлемент.Значение, СЗ);
				КонецЦикла;
			Иначе
				МнгСтр = Стр.ПолучитьЭлементы()[0];
				
				СтруктураМногостраничнойСтраницы = Новый Структура("УИД", МнгСтр.УИД);
				МакетДокумента = Отчеты[Разложение[1]].ПолучитьМакет(МнгСтр.ИмяМакета);
				Для Каждого Обл Из МакетДокумента.Области Цикл 
					Если Обл.ТипОбласти = ТипОбластиЯчеекТабличногоДокумента.Прямоугольник 
						И Обл.СодержитЗначение Тогда 
						
						СтруктураМногостраничнойСтраницы.Вставить(Обл.Имя);
					КонецЕсли;
				КонецЦикла;
				
				Если МнгСтр.ПолучитьЭлементы().Количество() > 0 Тогда
					СформироватьСтруктуруДанныхУведомленияРекНовогоОбразца(Форма, Разложение[1], МнгСтр);
				КонецЕсли;
				
				СЗ = Новый СписокЗначений;
				СЗ.Добавить(СтруктураМногостраничнойСтраницы);
				Форма.ДанныеМногостраничныхРазделов.Вставить(МнгСтр.ИДНаименования, СЗ);
			КонецЕсли;
		Иначе
			Форма.ИдентификаторыОбычныхСтраниц.Вставить(Стр.ИДНаименования, Стр.УИД);
			Если Стр.Многострочность Тогда
				СтруктураСтраницы = Новый Структура;
				МакетДокумента = Отчеты[Разложение[1]].ПолучитьМакет(Стр.ИмяМакета).ПолучитьОбласть("ОсновнаяЧасть");
				Для Каждого Обл Из МакетДокумента.Области Цикл 
					Если Обл.ТипОбласти = ТипОбластиЯчеекТабличногоДокумента.Прямоугольник 
						И Обл.СодержитЗначение Тогда 
						
						СтруктураСтраницы.Вставить(Обл.Имя);
					КонецЕсли;
				КонецЦикла;
				Форма.ДанныеУведомления.Вставить(Стр.ИДНаименования, СтруктураСтраницы);
				
				Для Каждого МногострочныйЭлемент Из Стр.МногострочныеЧасти Цикл
					ТЗ = Новый ТаблицаЗначений;
					ТЗ.Колонки.Добавить("УИД");
					СтрокаДанных = Новый Структура;
					МакетМногострочки = Отчеты[Разложение[1]].ПолучитьМакет(Стр.ИмяМакета).ПолучитьОбласть("Str_"+МногострочныйЭлемент.Значение);
					Для Каждого Обл Из МакетМногострочки.Области Цикл 
						Если Обл.ТипОбласти = ТипОбластиЯчеекТабличногоДокумента.Прямоугольник 
							И Обл.СодержитЗначение Тогда 
							
							ТЗ.Колонки.Добавить(Обл.Имя);
							СтрокаДанных.Вставить(Обл.Имя);
						КонецЕсли;
					КонецЦикла;
					
					Форма.ДанныеДопСтрок.Вставить(МногострочныйЭлемент.Значение, ПоместитьВоВременноеХранилище(ТЗ, Новый УникальныйИдентификатор));
					СЗ = Новый СписокЗначений;
					СЗ.Добавить(СтрокаДанных);
					Форма.ДанныеДопСтрокСтраницы.Вставить(МногострочныйЭлемент.Значение, СЗ);
				КонецЦикла;
			Иначе
				СтруктураСтраницы = Новый Структура;
				МакетДокумента = Отчеты[Разложение[1]].ПолучитьМакет(Стр.ИмяМакета).ПолучитьОбласть("ОсновнаяЧасть");
				Для Каждого Обл Из МакетДокумента.Области Цикл 
					Если Обл.ТипОбласти = ТипОбластиЯчеекТабличногоДокумента.Прямоугольник 
						И Обл.СодержитЗначение Тогда 
						
						СтруктураСтраницы.Вставить(Обл.Имя);
					КонецЕсли;
				КонецЦикла;
				Форма.ДанныеУведомления.Вставить(Стр.ИДНаименования, СтруктураСтраницы);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Функция СтрокаСодержитТолькоЦифры(Строка) Экспорт 
	Стр = СокрЛП(Строка);
	Для Инд = 1 По СтрДлина(Стр) Цикл 
		КодСимвола = КодСимвола(Сред(Стр, Инд, 1));
		Если НЕ (КодСимвола >= 48 И КодСимвола <= 57) Тогда
			Возврат Ложь;
		КонецЕсли; 
	КонецЦикла;
	Возврат Истина;
КонецФункции

Процедура ОчисткаОтчетаДействия(Параметры) Экспорт 
	Форма = Параметры.Форма;
	Форма.Объект.РегистрацияВИФНС = Документы.УведомлениеОСпецрежимахНалогообложения.РегистрацияВФНСОрганизации(Форма.Объект.Организация);
	Форма.СформироватьДеревоСтраниц();
	УведомлениеОСпецрежимахНалогообложения.СформироватьСтруктуруДанныхУведомленияНовогоОбразца(Форма);
	Форма.ЗаполнитьНачальныеДанные();
КонецПроцедуры

Процедура ДополнитьСлужебнымиСтруктурамиАдреса(ДанныеУведомления = Неопределено, ДанныеМногостраничныхРазделов = Неопределено) Экспорт 
	Если ДанныеУведомления <> Неопределено Тогда 
		Для Каждого КЗ Из ДанныеУведомления Цикл 
			Если КЗ.Значение.Свойство("РайонСокращение") 
				И Не КЗ.Значение.Свойство("АдресXML") Тогда
				
				КЗ.Значение.Вставить("АдресXML", "");
			КонецЕсли;
			
			Если КЗ.Значение.Свойство("АДДР00РайонСокращение") 
				И Не КЗ.Значение.Свойство("АДДР00АдресXML") Тогда
				
				КЗ.Значение.Вставить("АДДР00АдресXML", "");
			КонецЕсли;
			
			Если КЗ.Значение.Свойство("АДДР01РайонСокращение") 
				И Не КЗ.Значение.Свойство("АДДР00АдресXML") Тогда
				
				КЗ.Значение.Вставить("АДДР01АдресXML", "");
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если ДанныеМногостраничныхРазделов <> Неопределено Тогда 
		Для Каждого КЗ0 Из ДанныеМногостраничныхРазделов Цикл 
			Для Каждого Элт Из КЗ0.Значение Цикл 
				КЗ = Элт.Значение;
				
				Если КЗ.Свойство("РайонСокращение") 
					И Не КЗ.Свойство("АдресXML") Тогда
					
					КЗ.Вставить("АдресXML", "");
				КонецЕсли;
				
				Если КЗ.Свойство("АДДР00РайонСокращение") 
					И Не КЗ.Свойство("АДДР00АдресXML") Тогда
					
					КЗ.Вставить("АДДР00АдресXML", "");
				КонецЕсли;
				
				Если КЗ.Свойство("АДДР01РайонСокращение") 
					И Не КЗ.Свойство("АДДР00АдресXML") Тогда
					
					КЗ.Вставить("АДДР01АдресXML", "");
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
